package pl.allegro.finance.tradukisto.internal.languages.arabic

import pl.allegro.finance.tradukisto.internal.languages.AbstractIntegerValuesTest

import static pl.allegro.finance.tradukisto.internal.Container.arabicContainer

class ArabicIntegerValuesTest extends AbstractIntegerValuesTest {

    def setup() {
        intConverter = arabicContainer().getIntegerConverter()
    }

    @Override
    IntegerValuesTestData getTestData() {
        testData = new IntegerValuesTestData(integerTranslations)
    }

    private static integerTranslations = [
            0            : "صفر",
            1            : "واحد",
            2            : "اثنان",
            3            : "ثلاثة",
            4            : "أربعة",
            5            : "خمسة",
            6            : "ستة",
            7            : "سبعة",
            8            : "ثمانية",
            9            : "تسعة",
            10           : "عشرة",
            11           : "أحد عشر",
            12           : "اثنا عشر",
            13           : "ثلاثة عشر",
            14           : "أربعة عشر",
            15           : "خمسة عشر",
            16           : "ستة عشر",
            17           : "سبعة عشر",
            18           : "ثمانية عشر",
            19           : "تسعة عشر",
            20           : "عشرون",
            30           : "ثلاثون",
            40           : "أربعون",
            50           : "خمسون",
            60           : "ستون",
            70           : "سبعون",
            80           : "ثمانون",
            90           : "تسعون",
            21           : "واحد وعشرون",
            37           : "سبعة وثلاثون",
            43           : "ثلاثة وأربعون",
            58           : "ثمانية وخمسون",
            69           : "تسعة وستون",
            76           : "ستة وسبعون",
            82           : "اثنان وثمانون",
            95           : "خمسة وتسعون",
            100          : "مئة",
            200          : "مئتان",
            300          : "ثلاثمئة",
            400          : "أربعمئة",
            500          : "خمسمئة",
            600          : "ستمئة",
            700          : "سبعمئة",
            800          : "ثمانمئة",
            900          : "تسعمئة",
            111          : "مئة وأحد عشر",
            272          : "مئتان واثنان وسبعون",
            387          : "ثلاثمئة وسبعة وثمانون",
            448          : "أربعمئة وثمانية وأربعون",
            569          : "خمسمئة وتسعة وستون",
            625          : "ستمئة وخمسة وعشرون",
            782          : "سبعمئة واثنان وثمانون",
            895          : "ثمانمئة وخمسة وتسعون",
            999          : "تسعمئة وتسعة وتسعون",
            1_000        : "واحد ألف",
            2_000        : "اثنان آلاف",
            3_000        : "ثلاثة آلاف",
            4_000        : "أربعة آلاف",
            5_000        : "خمسة آلاف",
            7_634        : "سبعة آلاف ستمئة وأربعة وثلاثون",
            11_000       : "أحد عشر آلاف",
            15_000       : "خمسة عشر آلاف",
            21_000       : "واحد وعشرون آلاف",
            24_190       : "أربعة وعشرون آلاف مئة وتسعون",
            653_000      : "ستمئة وثلاثة وخمسون آلاف",
            123_454      : "مئة وثلاثة وعشرون آلاف أربعمئة وأربعة وخمسون",
            700_000      : "سبعمئة آلاف",
            999_999      : "تسعمئة وتسعة وتسعون آلاف تسعمئة وتسعة وتسعون",
            1_000_000    : "واحد مليون",
            2_000_000    : "اثنان ملايين",
            5_000_000    : "خمسة ملايين",
            23_437_219   : "ثلاثة وعشرون ملايين أربعمئة وسبعة وثلاثون آلاف مئتان وتسعة عشر",
            100_000_000  : "مئة ملايين",
            123_456_789  : "مئة وثلاثة وعشرون ملايين أربعمئة وستة وخمسون آلاف سبعمئة وتسعة وثمانون",
            322_089_890  : "ثلاثمئة واثنان وعشرون ملايين تسعة وثمانون آلاف ثمانمئة وتسعون",
            1_000_000_000: "واحد مليار",
            2_147_483_647: "اثنان مليارات مئة وسبعة وأربعون ملايين أربعمئة وثلاثة وثمانون آلاف ستمئة وسبعة وأربعون"
    ]
}
